# PANDAS

Dataframe--Special Object to data in tabular form(rows and Column)

In [4]:
# importing the pandas library

import pandas as pd

In [1]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\ridhima\appdata\roaming\python\python311\site-packages (2.2.0)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\ridhima\appdata\roaming\python\python311\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ridhima\appdata\roaming\python\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\ridhima\appdata\roaming\python\python311\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ridhima\appdata\roaming\python\python311\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\ridhima\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
pip install --upgrade pip

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pip in c:\users\ridhima\appdata\roaming\python\python311\site-packages (24.3.1)
Note: you may need to restart the kernel to use updated packages.

In [8]:
# creating a pandas dataframe

In [15]:
pip install scikit-learn

Defaulting to user installation because normal site-packages is not writeable
Collecting scikit-learn
  Downloading scikit_learn-1.5.2-cp311-cp311-win_amd64.whl.metadata (13 kB)
Requirement already satisfied: numpy>=1.19.5 in c:\users\ridhima\appdata\roaming\python\python311\site-packages (from scikit-learn) (1.26.4)
Collecting scipy>=1.6.0 (from scikit-learn)
  Downloading scipy-1.14.1-cp311-cp311-win_amd64.whl.metadata (60 kB)
Collecting joblib>=1.2.0 (from scikit-learn)
  Downloading joblib-1.4.2-py3-none-any.whl.metadata (5.4 kB)
Collecting threadpoolctl>=3.1.0 (from scikit-learn)
  Downloading threadpoolctl-3.5.0-py3-none-any.whl.metadata (13 kB)
Downloading scikit_learn-1.5.2-cp311-cp311-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
   ------ --------------------------------- 1.8/11.0 MB 10.1 MB/s eta 0:00:01
   --------------- ------------------------ 4.2/11.0 MB 9.7 MB/s eta 0:00:01
   ---------------------- ----------------- 6.3/11.0 MB 9.9 MB/s eta 0:00:01
   ----------------------------- ---------- 8.1/11.0 MB 10.1 MB/s eta 0:00:01
   -------------------------------------- - 10.5/11.0 MB 9.8 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 9.7 MB/s eta 0:00:00
Downloading joblib-1.4.2-py3-none-any.whl (301 kB)
Downloading scipy-1.14.1-cp311-cp311-win_amd64.whl (44.8 MB)
   ---------------------------------------- 0.0/44.8 MB ? eta -:--:--
   - -------------------------------------- 2.1/44.8 MB 11.7 MB/s eta 0:00:04
   --- ------------------------------------ 4.2/44.8 MB 10.9 MB/s eta 0:00:04
   ------ --------------------------------- 6.8/44.8 MB 11.3 MB/s eta 0:00:04
   -------- ------------------------------- 9.2/44.8 MB 11.4 MB/s eta 0:00:04
   ---------- ----------------------------- 11.5/44.8 MB 11.3 MB/s eta 0:00:03
   ------------ --------------------------- 13.9/44.8 MB 11.3 MB/s eta 0:00:03
   -------------- ------------------------- 16.3/44.8 MB 11.1 MB/s eta 0:00:03
   ---------------- ----------------------- 18.4/44.8 MB 11.0 MB/s eta 0:00:03
   ------------------ --------------------- 20.2/44.8 MB 11.0 MB/s eta 0:00:03
   ------------------- -------------------- 21.5/44.8 MB 10.4 MB/s eta 0:00:03
   -------------------- ------------------- 22.8/44.8 MB 10.0 MB/s eta 0:00:03
   --------------------- ------------------ 24.1/44.8 MB 9.7 MB/s eta 0:00:03
   ---------------------- ----------------- 25.7/44.8 MB 9.5 MB/s eta 0:00:03
   ------------------------ --------------- 27.5/44.8 MB 9.4 MB/s eta 0:00:02
   ------------------------- -------------- 29.1/44.8 MB 9.3 MB/s eta 0:00:02
   -------------------------- ------------- 30.1/44.8 MB 9.1 MB/s eta 0:00:02
   ---------------------------- ----------- 32.0/44.8 MB 9.0 MB/s eta 0:00:02
   ----------------------------- ---------- 33.6/44.8 MB 8.9 MB/s eta 0:00:02
   ------------------------------- -------- 34.9/44.8 MB 8.8 MB/s eta 0:00:02
   -------------------------------- ------- 36.7/44.8 MB 8.8 MB/s eta 0:00:01
   ---------------------------------- ----- 38.5/44.8 MB 8.8 MB/s eta 0:00:01
   ------------------------------------ --- 40.6/44.8 MB 8.8 MB/s eta 0:00:01
   ------------------------------------- -- 42.5/44.8 MB 8.9 MB/s eta 0:00:01
   ---------------------------------------  44.6/44.8 MB 8.9 MB/s eta 0:00:01
   ---------------------------------------- 44.8/44.8 MB 8.8 MB/s eta 0:00:00
Downloading threadpoolctl-3.5.0-py3-none-any.whl (18 kB)
Installing collected packages: threadpoolctl, scipy, joblib, scikit-learn
Successfully installed joblib-1.4.2 scikit-learn-1.5.2 scipy-1.14.1 threadpoolctl-3.5.0
Note: you may need to restart the kernel to use updated packages.

In [18]:
from sklearn.datasets import fetch_openml

In [19]:
boston_dataset=fetch_openml(data_id=531,as_frame=True)

In [24]:
boston_df=pd.DataFrame(boston_dataset.data)
print(boston_df.head())

      CRIM    ZN  INDUS CHAS    NOX     RM   AGE     DIS RAD    TAX  PTRATIO  \
0  0.00632  18.0   2.31    0  0.538  6.575  65.2  4.0900   1  296.0     15.3
1  0.02731   0.0   7.07    0  0.469  6.421  78.9  4.9671   2  242.0     17.8
2  0.02729   0.0   7.07    0  0.469  7.185  61.1  4.9671   2  242.0     17.8
3  0.03237   0.0   2.18    0  0.458  6.998  45.8  6.0622   3  222.0     18.7
4  0.06905   0.0   2.18    0  0.458  7.147  54.2  6.0622   3  222.0     18.7

        B  LSTAT
0  396.90   4.98
1  396.90   9.14
2  392.83   4.03
3  394.63   2.94
4  396.90   5.33

In [5]:
import numpy as np
import pandas as pd

In [9]:
# Try to create a dataframe
user_data={
    "MarksA":np.random.randint(1,100,5),
    "MarksB":np.random.randint(50,100,5),
    "MarksC":np.random.randint(1,100,5)
}

In [10]:
user_data

{'MarksA': array([28, 17, 73, 15, 69]),
 'MarksB': array([92, 84, 54, 99, 74]),
 'MarksC': array([ 7, 72, 48, 55, 61])}

In [7]:
np.random.randint(1,100,10)

array([27, 49, 70, 70,  7, 52, 28, 98, 18, 38])

In [15]:
df=pd.DataFrame(user_data,dtype='float32')
print(df)

   MarksA  MarksB  MarksC
0    28.0    92.0     7.0
1    17.0    84.0    72.0
2    73.0    54.0    48.0
3    15.0    99.0    55.0
4    69.0    74.0    61.0

In [13]:
df.head(n=3)

   MarksA  MarksB  MarksC
0      28      92       7
1      17      84      72
2      73      54      48

In [14]:
df.columns

Index(['MarksA', 'MarksB', 'MarksC'], dtype='object')

In [16]:
df.to_csv('marks.csv')

In [19]:
my_data=pd.read_csv('marks.csv')
my_data=my_data.drop(columns=['Unnamed: 0'])
my_data

   MarksA  MarksB  MarksC
0    28.0    92.0     7.0
1    17.0    84.0    72.0
2    73.0    54.0    48.0
3    15.0    99.0    55.0
4    69.0    74.0    61.0

# Pandas Basics-2

In [20]:
my_data.describe()

          MarksA    MarksB     MarksC
count   5.000000   5.00000   5.000000
mean   40.400000  80.60000  48.600000
std    28.404225  17.54423  24.865639
min    15.000000  54.00000   7.000000
25%    17.000000  74.00000  48.000000
50%    28.000000  84.00000  55.000000
75%    69.000000  92.00000  61.000000
max    73.000000  99.00000  72.000000

In [21]:
my_data.tail()

   MarksA  MarksB  MarksC
0    28.0    92.0     7.0
1    17.0    84.0    72.0
2    73.0    54.0    48.0
3    15.0    99.0    55.0
4    69.0    74.0    61.0

In [22]:
my_data.tail(n=3)

   MarksA  MarksB  MarksC
2    73.0    54.0    48.0
3    15.0    99.0    55.0
4    69.0    74.0    61.0

In [23]:
# Row
df.iloc[3]

MarksA    15.0
MarksB    99.0
MarksC    55.0
Name: 3, dtype: float32

In [24]:
# row and column access
df.iloc[3,1]

99.0

In [30]:
idx=[df.columns.get_loc('MarksB'),df.columns.get_loc('MarksC')]
print(idx)
df.iloc[3,idx]

[1, 2]

MarksB    99.0
MarksC    55.0
Name: 3, dtype: float32

In [31]:
df.iloc[:3,idx]

   MarksB  MarksC
0    92.0     7.0
1    84.0    72.0
2    54.0    48.0

In [32]:
df.iloc[:3,[1,2]]

   MarksB  MarksC
0    92.0     7.0
1    84.0    72.0
2    54.0    48.0

In [33]:
## Sort your Dataframe

In [34]:
my_data

   MarksA  MarksB  MarksC
0    28.0    92.0     7.0
1    17.0    84.0    72.0
2    73.0    54.0    48.0
3    15.0    99.0    55.0
4    69.0    74.0    61.0

In [35]:
my_data.sort_values(by=["MarksC","MarksA"],ascending=False)

   MarksA  MarksB  MarksC
1    17.0    84.0    72.0
4    69.0    74.0    61.0
3    15.0    99.0    55.0
2    73.0    54.0    48.0
0    28.0    92.0     7.0

In [36]:
data_array=my_data.values

In [38]:
print(type(data_array))
print(my_data.shape)

<class 'numpy.ndarray'>
(5, 3)

In [39]:
# Numpy array back into Dataframe

In [40]:
new_df=pd.DataFrame(data_array,dtype='int32',columns=["Physics","Chem","Maths"])

In [41]:
new_df

   Physics  Chem  Maths
0       28    92      7
1       17    84     72
2       73    54     48
3       15    99     55
4       69    74     61

In [43]:
new_df.to_csv("PCM.csv",index=False)

In [44]:
pcm=pd.read_csv('PCM.csv')

In [45]:
print(pcm)

   Physics  Chem  Maths
0       28    92      7
1       17    84     72
2       73    54     48
3       15    99     55
4       69    74     61